# CircuitType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..CircuitType Property
ElectricalSystem Class See Also
---
The circuit type of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public CircuitType CircuitType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CircuitType As CircuitType
	Get
```

Visual C++
---
```text
public:
property CircuitType CircuitType {
	CircuitType get ();
}
```

# Remarks
This read-only property is used to retrieve the circuit type of the Electrical System.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace